leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/spc560b54_portdefs.h
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_ADC PORT_GPIO_APC 
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_ADC PORT_GPIO_APC 
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_ADC PORT_GPIO_APC

#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_ADC PORT_GPIO_APC

#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_ADC PORT_GPIO_APC

#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_ADC PORT_GPIO_APC

#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_ADC PORT_GPIO_APC
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_ADC PORT_GPIO_APC

#endif  /* _SPC560B54PORTS_H */
